{"modelTopology":{"class_name":"Model","config":{"name":"autoencoder","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,140],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"encoder","class_name":"Model","config":{"name":"encoder","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,140],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":15,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":7,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense3",0,0]]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"decoder","class_name":"Model","config":{"name":"decoder","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":7,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":15,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":140,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["dense_Dense6",0,0]]},"inbound_nodes":[[["encoder",1,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["decoder",1,0]]},"keras_version":"tfjs-layers 1.2.11","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[140,15],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[15,7],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[7,2],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[2,7],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[7,15],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[15,140],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[140],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.2.11","convertedBy":null}